Revit 2027 API
AdvancedOpaque.OpaqueLuminanceModifier Property
 The property labeled "Luminance Scale" from the "AdvancedOpaque" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string OpaqueLuminanceModifier { get; }
Public Shared ReadOnly Property OpaqueLuminanceModifier As String
	Get
public:
static property String^ OpaqueLuminanceModifier {
	String^ get ();
}
static member OpaqueLuminanceModifier : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
AdvancedOpaque Class
Autodesk.Revit.DB.Visual Namespace